<?xml version="1.0" ?>
<net name="Sony_resume_test" version="10">
	<layers>
		<layer id="0" name="in" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,4,1424,2128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx_initializer_node_conv1_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="32,4,3,3" size="4608"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims1703/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4608" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="LeakyRelu_14183/Cast_15836_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="LeakyRelu_14183" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx_initializer_node_conv1_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="4740" shape="32,32,3,3" size="36864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_2/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_2/Dims1727/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="41604" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_2" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="LeakyRelu_34163/Cast_15828_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="LeakyRelu_34163" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="MaxPool_4" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1424</dim>
					<dim>2128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="onnx_initializer_node_conv2_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="41732" shape="64,32,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_5/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_5/Dims1739/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="115460" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_5" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="LeakyRelu_64227/Cast_15906_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="LeakyRelu_64227" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="onnx_initializer_node_conv2_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="115716" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_7/Dims1751/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="263172" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_7" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="LeakyRelu_84207/Cast_15838_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="LeakyRelu_84207" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="MaxPool_9" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx_initializer_node_conv3_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="263428" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_10/Dims1757/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="558340" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_10" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="LeakyRelu_114191/Cast_15904_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="LeakyRelu_114191" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="onnx_initializer_node_conv3_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="558852" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_12/Dims1661/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1148676" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_12" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="LeakyRelu_134175/Cast_15880_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="LeakyRelu_134175" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="MaxPool_14" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx_initializer_node_conv4_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1149188" shape="256,128,3,3" size="1179648"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_15/Dims1715/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2328836" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_15" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="LeakyRelu_164167/Cast_15858_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="LeakyRelu_164167" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx_initializer_node_conv4_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2329860" shape="256,256,3,3" size="2359296"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_17/Dims1691/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4689156" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_17" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="LeakyRelu_184171/Cast_15894_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="LeakyRelu_184171" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="MaxPool_19" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="onnx_initializer_node_conv5_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="4690180" shape="512,256,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_20/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_20/Dims1673/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="9408772" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_20" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="LeakyRelu_214187/Cast_15826_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="LeakyRelu_214187" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="onnx_initializer_node_conv5_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="9410820" shape="512,512,3,3" size="9437184"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_22/Dims1721/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="18848004" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_22" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="LeakyRelu_234203/Cast_15844_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="LeakyRelu_234203" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx_initializer_node_up6.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="18850052" shape="512,256,2,2" size="2097152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="ConvTranspose_24" type="ConvolutionBackpropData" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>89</dim>
					<dim>133</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Slice_33/Cast_15852_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947204" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Slice_33/Cast_25854_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947236" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Slice_33/Cast_35856_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947268" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Slice_33" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Slice_36/Cast_15846_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947204" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Slice_36/Cast_25848_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947300" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Slice_36/Cast_35850_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947268" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Slice_36" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Concat_37" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="onnx_initializer_node_conv6_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="20947332" shape="256,512,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_38/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_38/Dims1697/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="25665924" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_38" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="LeakyRelu_394215/Cast_15902_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="LeakyRelu_394215" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="onnx_initializer_node_conv6_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="25666948" shape="256,256,3,3" size="2359296"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_40/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_40/Dims1679/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="28026244" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_40" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="LeakyRelu_414195/Cast_15840_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="LeakyRelu_414195" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="onnx_initializer_node_up7.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="28027268" shape="256,128,2,2" size="524288"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="ConvTranspose_42" type="ConvolutionBackpropData" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>178</dim>
					<dim>266</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Slice_51/Cast_15882_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947204" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Slice_51/Cast_25884_const" type="Const" version="opset1">
			<data element_type="i64" offset="28551556" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Slice_51/Cast_35886_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947268" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Slice_51" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Slice_54/Cast_15868_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947204" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Slice_54/Cast_25870_const" type="Const" version="opset1">
			<data element_type="i64" offset="28551588" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Slice_54/Cast_35872_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947268" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Slice_54" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Concat_55" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx_initializer_node_conv7_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="28551620" shape="128,256,3,3" size="1179648"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_56/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_56/Dims1667/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="29731268" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_56" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="LeakyRelu_574159/Cast_15890_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="LeakyRelu_574159" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="onnx_initializer_node_conv7_2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="29731780" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_58/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_58/Dims1709/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="30321604" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_58" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="LeakyRelu_594223/Cast_15888_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="LeakyRelu_594223" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="onnx_initializer_node_up8.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="30322116" shape="128,64,2,2" size="131072"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="ConvTranspose_60" type="ConvolutionBackpropData" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>356</dim>
					<dim>532</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Slice_69/Cast_15862_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947204" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Slice_69/Cast_25864_const" type="Const" version="opset1">
			<data element_type="i64" offset="30453188" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Slice_69/Cast_35866_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947268" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Slice_69" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Slice_72/Cast_15896_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947204" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Slice_72/Cast_25898_const" type="Const" version="opset1">
			<data element_type="i64" offset="30453220" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Slice_72/Cast_35900_const" type="Const" version="opset1">
			<data element_type="i64" offset="20947268" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Slice_72" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Concat_73" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="onnx_initializer_node_conv8_1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="30453252" shape="64,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_74/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_74/Dims1733/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="30748164" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_74" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="LeakyRelu_754179/Cast_15892_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="LeakyRelu_754179" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>712</dim>
					<dim>1064</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
